Обработки/Reports/_ОтчетОДоходахИРасходахСбербанкСтрахование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетОДоходахИРасходахСбербанкСтрахование</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетОДоходахИРасходахСбербанкСтрахование/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчет о доходах и расходах (Сбербанк Страхование жизни)",
		"0.15",
		"",
		Истина);
		                                                                                             
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение",	ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык",				ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект",			ЭтотОбъект.Организация);
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.ПодписантРуководитель);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
	
	СтруктураКлюча.Вставить("КонтактноеЛицо", НастройкиОтчета.Подписант.КонтактноеЛицо);
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча));
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	Сформировать(ДокументРезультат, Новый ТабличныйДокумент);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПодписантРуководитель");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");

	Возврат Настройки;

КонецФункции

Процедура Сформировать(ДокументРезультат, ДокументРасшифровка) Экспорт 
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя();
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
	ДокументРезультат.Очистить();
	ДокументРасшифровка.Очистить();
	
	ТипЧисло = Новый ОписаниеТипов("Число"); 
	
	ОбластиИЗначения = Новый Структура;
	
	//таблицы с расшифровками прочих доходов и Расходов
	ПрочиеДоходы = Новый ТаблицаЗначений;
	ПрочиеДоходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеДоходы.Колонки.Добавить("Сумма", ТипЧисло);
	
	ПрочиеРасходы = Новый ТаблицаЗначений;
	ПрочиеРасходы.Колонки.Добавить("ПрочиеДоходыРасходы");
	ПрочиеРасходы.Колонки.Добавить("Сумма", ТипЧисло);	
	
	//колонки как запросе к 91-му. кроме Фильтра и Строки Отчета
	ТабРасшифровки = Новый ТаблицаЗначений;
	ТабРасшифровки.Колонки.Добавить("СтрокаОтчета");
	ТабРасшифровки.Колонки.Добавить("Счет");
	ТабРасшифровки.Колонки.Добавить("КорСчет");
	ТабРасшифровки.Колонки.Добавить("ПрочиеДоходыРасходы");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумаги");
	ТабРасшифровки.Колонки.Добавить("ЦенныеБумагиНаименование");
	ТабРасшифровки.Колонки.Добавить("ОбращаетсяНаОРЦБ");
	ТабРасшифровки.Колонки.Добавить("Фильтр");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотКт");
	ТабРасшифровки.Колонки.Добавить("СуммаОборотДт");
	ТабРасшифровки.Колонки.Добавить("Регистратор");
	
	ДатаНачальная = Период.ДатаНачала;
	ДатаКонечная = Период.ДатаОкончания;	
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");	
	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, ДатаКонечная, Перечисления.ВидыУчета.НалоговыйУчет);
		
	МакетНастройка = ПолучитьМакет("Настройка");
	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "Данные", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
		
	Если ТаблицаНастройки.Количество() = 0 Тогда
		
		Сообщить("Отсутствует настройка для отчета");
		
		РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

		Возврат;
		
	КонецЕсли;	
	
	ТаблицаРезультат = ОбщиеФункции.ЗапросДоходыРасходы(Организация, СчетДоверительногоУправления, ДатаКонечная, "НалоговыйУчет", ДатаНачальная);	
	ОбщиеФункции.РаспределениеРезультата(ТаблицаРезультат, ТаблицаНастройки, "ПрочиеДоходы", "ПрочиеРасходы", ОбластиИЗначения, ТабРасшифровки, ПрочиеДоходы, ПрочиеРасходы);
	
	//вывод формы
	Отчет = ПолучитьМакет("Отчет");
	ОбластьОтчет = Отчет.ПолучитьОбласть("Отчет");
	
	//шапка 
	ПараметрыШапки = РаботаСОтчетами.ПолучитьПараметрыШапки(ДатаКонечная, Организация, СчетДоверительногоУправления);
	
	ОбластьОтчет.Параметры.Заполнить(ПараметрыШапки);
	ОбластьОтчет.Параметры.ДатаДоговора			= Формат(ПараметрыШапки.ДатаДоговора, "ДФ=dd.MM.yyyy");
	ОбластьОтчет.Параметры.НомерДоговора = ПараметрыШапки.НомерДоговора;
	ОбластьОтчет.Параметры.ПериодОтчета = ПредставлениеПериода(ДатаНачальная, ДатаКонечная, "ФП=Истина");
	
	//показатели
	ОбщиеФункции.ЗаполнениеОбластиЗначениями(ОбластьОтчет, ОбластиИЗначения); 	

	//ОбщиеФункции.РасшифровкаПрочиеДоходыРасходы("ПрочиеДоходы", ОбластьОтчет, Отчет, ПрочиеДоходы);
	//ОбщиеФункции.РасшифровкаПрочиеДоходыРасходы("ПрочиеРасходы", ОбластьОтчет, Отчет, ПрочиеРасходы);	
	
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхРуководитель") Тогда 
		СтруктураДанныхРуководитель = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхРуководитель;	
		Если ЗначениеЗаполнено(СтруктураДанныхРуководитель) Тогда
			ОбластьОтчет.Параметры.ДолжностьРуководитель = СтруктураДанныхРуководитель.Должность + " (на основании " + СтруктураДанныхРуководитель.ОснованиеПолномочий +  ")";
			ОбластьОтчет.Параметры.Руководитель =  СтруктураДанныхРуководитель.КонтактноеЛицо;
		Иначе
			ОбластьОтчет.Параметры.ДолжностьРуководитель = "";
			ОбластьОтчет.Параметры.Руководитель =  "";			
		КонецЕсли;	
	КонецЕсли;
		
	Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхГлавбух") Тогда 
		СтруктураДанныхГлавбух = КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.СтруктураДанныхГлавбух;
		Если ЗначениеЗаполнено(СтруктураДанныхГлавбух) Тогда
			ОбластьОтчет.Параметры.ДолжностьГлавБух = СтруктураДанныхГлавбух.Должность;
			ОбластьОтчет.Параметры.Ответственный =  СтруктураДанныхГлавбух.КонтактноеЛицо;
		Иначе
			ОбластьОтчет.Параметры.ДолжностьГлавБух = "";
			ОбластьОтчет.Параметры.Ответственный =  "";
		КонецЕсли;
	КонецЕсли;	
	
	ДокументРезультат.Вывести(ОбластьОтчет);	
	
	КлючПараметровПечати = "РасшифровкаОтчетаОФинрезультатахСБ_СЖ";
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, КлючПараметровПечати, , ОриентацияСтраницы.Портрет);		
		
	//Расшифровка
	ОбщиеФункции.ПечатьРасшифровки(ПолучитьМакет("Расшифровка"), ДокументРасшифровка, ТабРасшифровки);
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя(), Истина, ОриентацияСтраницы.Портрет);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры	
	
Процедура ПроверкаНастроек(ДокументРезультат)	Экспорт
	
	ОбщиеФункции = РаботаСДополнительнымиОтчетамиИОбработками.ПолучитьОбъектВнешнейОбработки("_ОтчетыДоходыРасходыОбщиеФункции");
	
	МакетНастройка = ПолучитьМакет("Настройка");	
	НастройкиУчетаАктивов = ОбщиеФункции.ПолучитьНастройкиУчетаАктивов(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);
	НастройкиУчетаКомиссии = ОбщиеФункции.ПолучитьНастройкиУчетаКомиссии(Организация, СчетДоверительногоУправления, Период.ДатаОкончания, Перечисления.ВидыУчета.НалоговыйУчет);	

	ТаблицаНастройки = ОбщиеФункции.ПолучитьТаблицуНастроекИзМакета(МакетНастройка, "Заголовки", "Данные", "Колонки", НастройкиУчетаАктивов, НастройкиУчетаКомиссии);	
	
	ВидыУчета = Новый Массив;
	ВидыУчета.Добавить(Перечисления.ВидыУчета.НалоговыйУчет);
		
	Параметры = Новый Структура;
	Параметры.Вставить("ВидыУчета", ВидыУчета);
	Параметры.Вставить("Организация", ЭтотОбъект.Организация);
	Параметры.Вставить("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Параметры.Вставить("ОтчетнаяДата", ЭтотОбъект.Период.ДатаОкончания);
	Параметры.Вставить("НачальнаяДата", ЭтотОбъект.Период.ДатаНачала);
	
	ОбщиеФункции.ПроверкаНастроек(ДокументРезультат, ТаблицаНастройки, Параметры);
		
КонецПроцедуры
